app/Controllers/Home.php

SELECT *
FROM `menu`
---
    public function index()
    {
        $menus = $this->menuModel->findAll();