app/Controllers/Menu.php

SELECT *
FROM `menu`
---
    public function index()
    {
        $menus = $this->menuModel->findAll();

INSERT INTO `menu` (`kd_menu`, `nm_menu`, `harga`, `gambar`) VALUES ('2fd627973992e34cd3a946edaf7c2888', 'Nasi Goreng 7', '20000', '1683514569_5556a0f45b01760769b1.jpg')
---
    public function store()
    {
        $validation = Services::Validation();

        $validation->setRules([
            'gambar' => 'is_image[gambar]',
            'menu' => 'required|string',
            'harga' => "required|integer"

        ]);

        if ($validation->withRequest($this->request)->run()) {
            $imageFile = $this->request->getFile('gambar');
            $imageFile->move(ROOTPATH . "public/uploads/", $imageFile->getRandomName());
            $data = [
                'kd_menu' => md5($this->request->getVar("menu") . random_int(0, 1000) . $imageFile->getFilename()),
                'nm_menu' => $this->request->getVar("menu"),
                "harga" => $this->request->getVar("harga"),
                "gambar" => $imageFile->getName()
            ];

            $this->menuModel->insert($data);

SELECT *
FROM `menu`
WHERE `menu`.`id` = '14'
---
    public function edit($id)
    {
        $data = $this->menuModel->find($id);

SELECT *
FROM `menu`
WHERE `menu`.`id` = '14'
---
    public function update($id)
    {
        $this->request->withMethod("put");

        $menu = $this->menuModel->find($id);

UPDATE `menu` SET `gambar` = '1682991094_2dd358127f53d9a77612.jpg', `nm_menu` = 'Nasi Kucing', `harga` = '15000'
WHERE `menu`.`id` IN ('14')
---
                $data["gambar"] = $imageFile->getName();
            }

            $this->menuModel->update($id, $data);

SELECT *
FROM `menu`
WHERE `menu`.`id` = '15'
DELETE FROM `menu`
WHERE `id` IN ('15')
---
    public function delete($id)
    {
        $this->request->withMethod("delete");
        $menu = $this->menuModel->find($id);
        unlink(ROOTPATH . "public/uploads/" . $menu["gambar"]);
        $this->menuModel->delete($id);