app/Controllers/Transaksi.php

    public function index()
    {
        $transaksiModel = model(TransaksiModel::class);
        $data = $transaksiModel->findAll();
---
SELECT *
FROM `transaksi`